app/views/baners/_show.html.erb

  <div class="carousel-inner" role="listbox">
    <% @banners = Baner.all %>
---
SELECT  "baners".* FROM "baners"  ORDER BY "baners"."id" ASC LIMIT 1