app/views/microposts/show.html.erb

  <div class="clearfix"></div>
  <% if @post.post_comments.any? %>
---
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."micropost_id" IS NULL  ORDER BY "post_comments"."id" ASC LIMIT 1
SELECT  1 AS one FROM "post_comments" WHERE "post_comments"."micropost_id" = ? LIMIT 1  [["micropost_id", 16]]