app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ?  ORDER BY "categories"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."category_id" = ?  ORDER BY created_at DESC LIMIT 1  [["category_id", 1]]
---
  def show
    @category = Category.where(:id => params[:id]).first
    category_id = @category.id
    @posts = Micropost.where(category_id: category_id)