app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["category_id", 1], ["user_id", 1], ["created_at", "2015-05-20 13:59:21.277778"], ["updated_at", "2015-05-20 13:59:21.277778"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 16]]
---
  def show
    @post = Micropost.find(params[:id])