app/controllers/news_posts_controller.rb

SELECT "news_posts".* FROM "news_posts"  ORDER BY created_at DESC
---
  def index
    @news = NewsPost.all

SELECT  "news_posts".* FROM "news_posts" WHERE "news_posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 2]]
---
  def show
    @news_post = NewsPost.find(params[:id])