app/controllers/post_comments_controller.rb

SELECT "post_comments".* FROM "post_comments"
---
  def index
    @comments = PostComment.all

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 16]]
INSERT INTO "post_comments" ("content", "micropost_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "rgdrghdfzgfdgzgz"], ["micropost_id", 16], ["user_id", 1], ["created_at", "2015-05-24 17:47:06.425705"], ["updated_at", "2015-05-24 17:47:06.425705"]]
---
  def create
    @micropost = Micropost.find(params[:micropost_id])
    @comment = PostComment.new(comment_params)
    @comment.micropost = @micropost
    @comment.user = current_user
    if @comment.save