app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def home
    if signed_in?
      @micropost  = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])

SELECT "microposts".* FROM "microposts"  ORDER BY created_at DESC
SELECT "news_posts".* FROM "news_posts"  ORDER BY created_at DESC
SELECT  "microposts".* FROM "microposts"  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT  "news_posts".* FROM "news_posts"  ORDER BY created_at DESC LIMIT 5
SELECT "categories".* FROM "categories"
---
  def index
    @posts = Micropost.all
    @posts = @posts.paginate(page: params[:page])
    @news = NewsPost.first(3)
    @categories = Category.all