app/views/categories/_categories.html.erb

  <ul>
    <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"